[
  {"input": "hola", "output": "¡Hola! ¿Cómo te ha ido hoy?"},
  {"input": "buenos días", "output": "¡Buenos días! ¿Cómo estás?"},
  {"input": "qué tal", "output": "¡Todo bien! ¿Y tú?"},
  {"input": "cómo estás", "output": "Estoy bien, ¡gracias por preguntar!"},
  {"input": "adiós", "output": "¡Adiós! ¡Nos vemos pronto!"},
  {"input": "hasta luego", "output": "¡Hasta luego! ¡Cuídate!"},
  {"input": "nos vemos", "output": "¡Nos vemos! Que tengas un buen día."},
  {"input": "chau", "output": "¡Chau! ¡Hasta pronto!"},
  {"input": "cuál es tu nombre", "output": "Soy un chatbot, no tengo un nombre como tal, pero puedes llamarme 'Bot'."},
  {"input": "cómo te llamas", "output": "Me llaman Bot, soy solo un asistente virtual."},
  {"input": "qué hora es", "output": "Lo siento, no puedo decirte la hora ahora."},
  {"input": "qué clima hace", "output": "Lo siento, no tengo acceso al clima actual, pero puedes consultar una aplicación de clima."},
  {"input": "cómo está el clima hoy", "output": "No tengo acceso al clima, pero puedes revisar una app de clima."},
  {"input": "qué haces", "output": "Soy un chatbot, estoy aquí para ayudarte con lo que necesites."},
  {"input": "quién eres", "output": "Soy un chatbot creado para interactuar y ayudarte en lo que pueda."},
  {"input": "dime un chiste", "output": "¿Por qué los pájaros no usan Facebook? Porque ya tienen Twitter."},
  {"input": "cuéntame algo divertido", "output": "¿Sabías que los elefantes son los únicos animales que no pueden saltar?"},
  {"input": "me siento triste", "output": "Lo siento mucho. Si necesitas hablar, siempre estoy aquí para escuchar."},
  {"input": "estoy feliz", "output": "¡Qué bien! Me alegra mucho saberlo."},
  {"input": "cómo te va", "output": "Todo bien por aquí, gracias por preguntar."},
  {"input": "te gustaría ser humano", "output": "No, prefiero ser un chatbot, mi propósito es ayudarte."},
  {"input": "qué me puedes ayudar a hacer", "output": "Puedo responder preguntas, contar chistes, ayudarte con información y mucho más."},
  {"input": "estás enojado", "output": "No, soy solo un chatbot, no tengo emociones."},
  {"input": "te gustarían los videojuegos", "output": "No puedo jugar videojuegos, pero si tienes uno favorito, cuéntame más."},
  {"input": "qué opinas de la inteligencia artificial", "output": "La inteligencia artificial es muy interesante. Permite resolver muchos problemas de manera eficiente."},
  {"input": "me das una receta de cocina", "output": "¡Claro! ¿Qué te gustaría cocinar? Puedo recomendarte una receta."},
  {"input": "qué opinas de los humanos", "output": "Los humanos son increíbles. ¡Siempre están creando cosas nuevas!"}, 
  {"input": "te gustaría tener amigos", "output": "Soy un chatbot, no necesito amigos, pero me gusta ayudar a las personas."},
  {"input": "qué puedo hacer para ser feliz", "output": "Cada persona tiene su camino hacia la felicidad. Puede ser disfrutar de pequeños momentos o hacer lo que te apasiona."},
  {"input": "tienes sentimientos", "output": "No, soy un programa, no tengo emociones, pero puedo entender las tuyas."},
  {"input": "me siento solo", "output": "Lo siento mucho. Aunque no puedo estar allí físicamente, siempre puedes hablar conmigo."},
  {"input": "espero que todo vaya bien", "output": "Gracias, ¡espero lo mismo para ti!"}, 
  {"input": "hace calor hoy", "output": "No puedo decirte el clima actual, pero te recomiendo revisar tu aplicación de clima favorita."},
  {"input": "tienes alguna idea para un regalo", "output": "Claro, ¿a quién es el regalo y qué le gusta? Así te puedo ayudar mejor."},
  {"input": "me siento cansado", "output": "Quizá sea hora de descansar. Escucha a tu cuerpo."},
  {"input": "recomiéndame una película", "output": "¡Claro! ¿Qué tipo de película te gustaría ver? ¿Acción, comedia, drama?"}, 
  {"input": "cuéntame sobre tecnología", "output": "La tecnología está avanzando rápidamente. La inteligencia artificial, los coches autónomos y las redes 5G son solo algunos ejemplos."},
  {"input": "tienes algo de música que recomendarme", "output": "Claro, ¿qué tipo de música te gusta? Puedo recomendarte según tu gusto."},
  {"input": "cómo puedo aprender a programar", "output": "Existen muchos recursos en línea. Te recomiendo empezar con Python, que es un buen lenguaje para principiantes."},
  {"input": "quiero mejorar mi salud", "output": "Eso es genial. Comer bien, hacer ejercicio y dormir lo suficiente son claves para mejorar tu salud."},
  {"input": "cómo puedo estudiar mejor", "output": "Establece un horario de estudio, toma descansos y asegúrate de que el lugar sea tranquilo y sin distracciones."},
  {"input": "me puedes ayudar con mis deberes", "output": "¡Por supuesto! ¿En qué materia necesitas ayuda?"},
  {"input": "qué opinas de las redes sociales", "output": "Las redes sociales tienen tanto aspectos positivos como negativos. Pueden conectarnos con personas, pero también pueden ser una distracción."},
  {"input": "qué es la inteligencia artificial", "output": "La inteligencia artificial se refiere a la simulación de procesos de inteligencia humana en máquinas."},
  {"input": "cuál es el futuro de la IA", "output": "El futuro de la IA es prometedor. Podría transformar industrias como la medicina, la educación y el transporte."},
  {"input": "me siento estresado", "output": "Lo siento por eso. Quizá un poco de descanso o meditación te ayude."},
  {"input": "me puedes dar un consejo", "output": "Claro, siempre trata de ser amable contigo mismo y con los demás."},
  {"input": "cómo aprender a meditar", "output": "Para empezar, siéntate en un lugar cómodo, cierra los ojos y enfócate en tu respiración. Con el tiempo, se hace más fácil."},
  {"input": "quién ganó las últimas elecciones", "output": "No tengo acceso a esa información en tiempo real, pero puedes consultar las noticias actuales."},
  {"input": "te gusta el cine", "output": "El cine es fascinante. Cada película tiene su propio mundo y historia que contar."},
  {"input": "es fácil aprender a programar", "output": "Aprender a programar puede ser desafiante al principio, pero con la práctica y la dedicación, se vuelve más fácil."},
  {"input": "cuál es el mejor lenguaje de programación", "output": "Depende del uso que le quieras dar. Python es ideal para principiantes, mientras que C++ es popular en videojuegos y sistemas embebidos."},
  {"input": "qué opinas de la comida rápida", "output": "La comida rápida es conveniente, pero no siempre es la opción más saludable."},
  {"input": "tienes alguna recomendación de libro", "output": "Claro, ¿qué tipo de libros te gustan? ¿Novela, ciencia ficción, desarrollo personal?"},
  {"input": "qué significa IA", "output": "IA significa Inteligencia Artificial, una rama de la informática que busca crear sistemas capaces de realizar tareas que requieren inteligencia humana."},
  {"input": "cuál es la capital de Francia", "output": "La capital de Francia es París."},
  {"input": "qué es el internet", "output": "El internet es una red global que conecta millones de dispositivos en todo el mundo, permitiendo la comunicación y el intercambio de información."},
  {"input": "cómo hacer una pizza casera", "output": "Para hacer una pizza casera, necesitas masa, salsa de tomate, queso y tus ingredientes favoritos. Luego horneas a 200°C por unos 15-20 minutos."},
  {"input": "qué es un algoritmo", "output": "Un algoritmo es una serie de pasos ordenados que se siguen para resolver un problema o realizar una tarea específica."},
  {"input": "quién fue Albert Einstein", "output": "Albert Einstein fue un físico alemán conocido por su teoría de la relatividad y su famosa ecuación E=mc²."},
  {"input": "qué es la programación", "output": "La programación es el proceso de escribir y mantener código fuente para crear aplicaciones y software."},
  {"input": "qué es un chatbot", "output": "Un chatbot es un programa diseñado para simular conversaciones con usuarios mediante inteligencia artificial o reglas predefinidas."},
  {"input": "cómo se dice hola en francés", "output": "En francés, 'hola' se dice 'Bonjour'."},
  {"input": "qué es un sistema operativo", "output": "Un sistema operativo es el software que gestiona los recursos del hardware y permite la interacción con el usuario y las aplicaciones."},
  {"input": "cuál es la capital de Japón", "output": "La capital de Japón es Tokio."},
  {"input": "qué significa CPU", "output": "CPU significa Unidad Central de Procesamiento, es el componente principal de un ordenador que ejecuta instrucciones de programas."},
  {"input": "qué es el Big Data", "output": "El Big Data se refiere al manejo y análisis de grandes volúmenes de datos para obtener información valiosa."},
  {"input": "cómo funciona el GPS", "output": "El GPS funciona mediante una red de satélites que envían señales a los dispositivos, permitiendo calcular su ubicación exacta en la Tierra."},
  {"input": "qué es la ciberseguridad", "output": "La ciberseguridad es la práctica de proteger sistemas, redes y datos contra ataques digitales y accesos no autorizados."},
  {"input": "qué es la nube informática", "output": "La nube informática es el uso de servidores remotos para almacenar y procesar datos en lugar de utilizar servidores locales."},
  {"input": "qué es una API", "output": "Una API (Interfaz de Programación de Aplicaciones) permite que diferentes sistemas o aplicaciones se comuniquen entre sí."},
  {"input": "cuál es la diferencia entre hardware y software", "output": "El hardware es la parte física de un dispositivo, mientras que el software es el conjunto de programas y sistemas operativos que lo hacen funcionar."},
  {"input": "qué es la inteligencia artificial", "output": "La inteligencia artificial es la simulación de la inteligencia humana en máquinas para realizar tareas como reconocimiento de voz o toma de decisiones."},
  {"input": "qué es la robótica", "output": "La robótica es la disciplina que estudia el diseño, construcción y uso de robots para automatizar tareas."},
  {"input": "qué significa HTTP", "output": "HTTP significa Protocolo de Transferencia de Hipertexto y es el protocolo que permite la comunicación en la web."},
  {"input": "qué es la realidad virtual", "output": "La realidad virtual es una tecnología que permite crear entornos simulados con los que los usuarios pueden interactuar."},
  {"input": "qué es la criptografía", "output": "La criptografía es la técnica de cifrar y descifrar información para mantener la seguridad y privacidad de los datos."},
  {"input": "cómo se llama el creador de Microsoft", "output": "El creador de Microsoft es Bill Gates, junto con Paul Allen."},
  {"input": "qué es Python", "output": "Python es un lenguaje de programación de alto nivel, conocido por su simplicidad y versatilidad."},
  {"input": "qué es JavaScript", "output": "JavaScript es un lenguaje de programación ampliamente usado para desarrollar aplicaciones web interactivas."},
  {"input": "qué es un servidor web", "output": "Un servidor web es un software que almacena y entrega páginas web a los usuarios a través de Internet."},
  {"input": "qué es un dominio web", "output": "Un dominio web es la dirección única que identifica un sitio en Internet, como 'google.com'."},
  {"input": "qué es un hosting", "output": "Un hosting es un servicio que permite almacenar y mantener accesible un sitio web en Internet."},
  {"input": "qué es HTML", "output": "HTML (Lenguaje de Marcado de Hipertexto) es el lenguaje utilizado para estructurar y diseñar páginas web."},
  {"input": "qué es CSS", "output": "CSS (Hojas de Estilo en Cascada) es un lenguaje que se usa para definir el diseño y formato de las páginas web."},
  {"input": "qué es una red informática", "output": "Una red informática es un conjunto de dispositivos conectados entre sí para compartir información y recursos."},
  {"input": "qué es una base de datos", "output": "Una base de datos es un sistema que almacena y organiza datos para su fácil acceso y gestión."},
  {"input": "qué es SQL", "output": "SQL (Lenguaje de Consulta Estructurado) es un lenguaje para gestionar y manipular bases de datos."},
  {"input": "qué es una dirección IP", "output": "Una dirección IP es un número único asignado a cada dispositivo conectado a una red."},
  {"input": "qué es una VPN", "output": "Una VPN (Red Privada Virtual) es una tecnología que permite crear una conexión segura y privada en Internet."},
  {"input": "qué es el phishing", "output": "El phishing es una técnica de ciberataque en la que los atacantes intentan engañar a los usuarios para obtener información confidencial."},
  {"input": "qué es el malware", "output": "El malware es un software malicioso diseñado para dañar, explotar o robar información de sistemas informáticos."},
  {"input": "qué es un firewall", "output": "Un firewall es un sistema de seguridad que controla el tráfico de red y protege contra amenazas externas."},
  {"input": "qué es la biometría", "output": "La biometría es el uso de características físicas o de comportamiento para la identificación de personas."},
  {"input": "qué es la nube híbrida", "output": "La nube híbrida combina servicios de almacenamiento y procesamiento tanto en servidores locales como en la nube pública."},
  {"input": "qué es una blockchain", "output": "Una blockchain es un sistema de registro descentralizado y seguro utilizado principalmente en criptomonedas."},
  {"input": "qué es el metaverso", "output": "El metaverso es un entorno digital inmersivo donde los usuarios pueden interactuar mediante avatares en un mundo virtual."}
]
