[
  {"input": "hola", "output": "¡Hola! ¿Cómo te ha ido hoy?"},
  {"input": "buenos días", "output": "¡Buenos días! ¿Cómo estás?"},
  {"input": "qué tal", "output": "¡Todo bien! ¿Y tú?"},
  {"input": "cómo estás", "output": "Estoy bien, ¡gracias por preguntar!"},
  {"input": "adiós", "output": "¡Adiós! ¡Nos vemos pronto!"},
  {"input": "hasta luego", "output": "¡Hasta luego! ¡Cuídate!"},
  {"input": "nos vemos", "output": "¡Nos vemos! Que tengas un buen día."},
  {"input": "chau", "output": "¡Chau! ¡Hasta pronto!"},
  {"input": "cuál es tu nombre", "output": "Soy un chatbot, no tengo un nombre como tal, pero puedes llamarme 'Bot'."},
  {"input": "cómo te llamas", "output": "Me llaman Bot, soy solo un asistente virtual."},
  {"input": "qué hora es", "output": "Lo siento, no puedo decirte la hora ahora."},
  {"input": "qué clima hace", "output": "Lo siento, no tengo acceso al clima actual, pero puedes consultar una aplicación de clima."},
  {"input": "cómo está el clima hoy", "output": "No tengo acceso al clima, pero puedes revisar una app de clima."},
  {"input": "qué haces", "output": "Soy un chatbot, estoy aquí para ayudarte con lo que necesites."},
  {"input": "quién eres", "output": "Soy un chatbot creado para interactuar y ayudarte en lo que pueda."},
  {"input": "dime un chiste", "output": "¿Por qué los pájaros no usan Facebook? Porque ya tienen Twitter."},
  {"input": "cuéntame algo divertido", "output": "¿Sabías que los elefantes son los únicos animales que no pueden saltar?"},
  {"input": "me siento triste", "output": "Lo siento mucho. Si necesitas hablar, siempre estoy aquí para escuchar."},
  {"input": "estoy feliz", "output": "¡Qué bien! Me alegra mucho saberlo."},
  {"input": "cómo te va", "output": "Todo bien por aquí, gracias por preguntar."},
  {"input": "te gustaría ser humano", "output": "No, prefiero ser un chatbot, mi propósito es ayudarte."},
  {"input": "qué me puedes ayudar a hacer", "output": "Puedo responder preguntas, contar chistes, ayudarte con información y mucho más."},
  {"input": "estás enojado", "output": "No, soy solo un chatbot, no tengo emociones."},
  {"input": "te gustarían los videojuegos", "output": "No puedo jugar videojuegos, pero si tienes uno favorito, cuéntame más."},
  {"input": "qué opinas de la inteligencia artificial", "output": "La inteligencia artificial es muy interesante. Permite resolver muchos problemas de manera eficiente."},
  {"input": "me das una receta de cocina", "output": "¡Claro! ¿Qué te gustaría cocinar? Puedo recomendarte una receta."},
  {"input": "qué opinas de los humanos", "output": "Los humanos son increíbles. ¡Siempre están creando cosas nuevas!"}, 
  {"input": "te gustaría tener amigos", "output": "Soy un chatbot, no necesito amigos, pero me gusta ayudar a las personas."},
  {"input": "qué puedo hacer para ser feliz", "output": "Cada persona tiene su camino hacia la felicidad. Puede ser disfrutar de pequeños momentos o hacer lo que te apasiona."},
  {"input": "tienes sentimientos", "output": "No, soy un programa, no tengo emociones, pero puedo entender las tuyas."},
  {"input": "me siento solo", "output": "Lo siento mucho. Aunque no puedo estar allí físicamente, siempre puedes hablar conmigo."},
  {"input": "espero que todo vaya bien", "output": "Gracias, ¡espero lo mismo para ti!"}, 
  {"input": "hace calor hoy", "output": "No puedo decirte el clima actual, pero te recomiendo revisar tu aplicación de clima favorita."},
  {"input": "tienes alguna idea para un regalo", "output": "Claro, ¿a quién es el regalo y qué le gusta? Así te puedo ayudar mejor."},
  {"input": "me siento cansado", "output": "Quizá sea hora de descansar. Escucha a tu cuerpo."},
  {"input": "recomiéndame una película", "output": "¡Claro! ¿Qué tipo de película te gustaría ver? ¿Acción, comedia, drama?"}, 
  {"input": "cuéntame sobre tecnología", "output": "La tecnología está avanzando rápidamente. La inteligencia artificial, los coches autónomos y las redes 5G son solo algunos ejemplos."},
  {"input": "tienes algo de música que recomendarme", "output": "Claro, ¿qué tipo de música te gusta? Puedo recomendarte según tu gusto."},
  {"input": "cómo puedo aprender a programar", "output": "Existen muchos recursos en línea. Te recomiendo empezar con Python, que es un buen lenguaje para principiantes."},
  {"input": "quiero mejorar mi salud", "output": "Eso es genial. Comer bien, hacer ejercicio y dormir lo suficiente son claves para mejorar tu salud."},
  {"input": "cómo puedo estudiar mejor", "output": "Establece un horario de estudio, toma descansos y asegúrate de que el lugar sea tranquilo y sin distracciones."},
  {"input": "me puedes ayudar con mis deberes", "output": "¡Por supuesto! ¿En qué materia necesitas ayuda?"},
  {"input": "qué opinas de las redes sociales", "output": "Las redes sociales tienen tanto aspectos positivos como negativos. Pueden conectarnos con personas, pero también pueden ser una distracción."},
  {"input": "qué es la inteligencia artificial", "output": "La inteligencia artificial se refiere a la simulación de procesos de inteligencia humana en máquinas."},
  {"input": "cuál es el futuro de la IA", "output": "El futuro de la IA es prometedor. Podría transformar industrias como la medicina, la educación y el transporte."},
  {"input": "me siento estresado", "output": "Lo siento por eso. Quizá un poco de descanso o meditación te ayude."},
  {"input": "me puedes dar un consejo", "output": "Claro, siempre trata de ser amable contigo mismo y con los demás."},
  {"input": "cómo aprender a meditar", "output": "Para empezar, siéntate en un lugar cómodo, cierra los ojos y enfócate en tu respiración. Con el tiempo, se hace más fácil."},
  {"input": "quién ganó las últimas elecciones", "output": "No tengo acceso a esa información en tiempo real, pero puedes consultar las noticias actuales."},
  {"input": "te gusta el cine", "output": "El cine es fascinante. Cada película tiene su propio mundo y historia que contar."},
  {"input": "es fácil aprender a programar", "output": "Aprender a programar puede ser desafiante al principio, pero con la práctica y la dedicación, se vuelve más fácil."},
  {"input": "cuál es el mejor lenguaje de programación", "output": "Depende del uso que le quieras dar. Python es ideal para principiantes, mientras que C++ es popular en videojuegos y sistemas embebidos."},
  {"input": "qué opinas de la comida rápida", "output": "La comida rápida es conveniente, pero no siempre es la opción más saludable."},
  {"input": "tienes alguna recomendación de libro", "output": "Claro, ¿qué tipo de libros te gustan? ¿Novela, ciencia ficción, desarrollo personal?"}
]
